{
	"parabola": {
		"description": "<p>The parabola was studied by Menaechmus who was a pupil of Plato and Eudoxus. He attempted to duplicate the cube, namely to find side of a cube that has a volume double that of a given cube. Hence he attempted to solve x3 = 2 by geometrical methods. In fact the geometrical methods of ruler and compass constructions cannot solve this (but Menaechmus did not know this). Menaechmus solved it by finding the intersection of the two parabolas x2 = y and y2 = 2x.</p><p>Euclid wrote about the parabola and it was given its present name by Apollonius. The focus and directrix of a parabola were considered by Pappus. Pascal considered the parabola as a projection of a circle and Galileo showed that projectiles follow parabolic paths. Gregory and Newton considered the properties of a parabola which bring parallel rays of light to a focus.</p><p>The pedal of the parabola with its vertex as pedal point is a cissoid. The pedal of the parabola with its focus as pedal point is a straight line. With the foot of the directrix as pedal point it is a right strophoid (an oblique strophoid for any other point of the directrix). The pedal curve when the pedal point is the image of the focus in the directrix is a Trisectrix of Maclaurin.</p><p>The evolute of the parabola is Neile's parabola. From a point above the evolute three normals can be drawn to the parabola, while only one normal can be drawn to the parabola from a point below the evolute.</p>",
		"equation":	""
	},
	"astroid": {
		"description": "The astroid was first discussed by Johann Bernoulli in 1691-92. It also appears in Leibniz's correspondence of 1715. It is sometimes called the tetracuspid for the obvious reason that it has four cusps. The astroid only acquired its present name in 1836 in a book published in Vienna. It has been known by various names in the literature, even after 1836, including cubocycloid and paracycle.<br><br>The length of the astroid is 6a and its area is 3&#120587;a2/8. The gradient of the tangent T from the point with parameter p is -tan(p). The equation of this tangent T is:<p class='math'>x sin(p) + y cos(p) = a sin(2p)/2</p>Let T cut the x-axis and the y-axis at X and Y respectively. Then the length XY is a constant and is equal to a. It can be formed by rolling a circle of radius a/4 on the inside of a circle of radius a. It can also be formed as the envelope produced when a line segment is moved with each end on one of a pair of perpendicular axes. It is therefore a glissette.",
		"equation":	""
	},
	"bicorn": {
		"description": "no description available",
		"equation":	""
	},
	"cardiod": {
		"description": "no description available",
		"equation":	""
	},
	"cayleysSextic": {
		"description": "no description available",
		"equation":	""
	},
	"cissoidOfDiocles": {
		"description": "no description available",
		"equation":	""
	},
	"cochleoid": {
		"description": "no description available",
		"equation":	""
	},
	"conchoid": {
		"description": "no description available",
		"equation":	""
	},
	"conchoidOfDeSluze": {
		"description": "no description available",
		"equation":	""
	},
	"cycloid": {
		"description": "no description available",
		"equation":	""
	},
	"curateCycloid": {
		"description": "no description available",
		"equation":	""
	},
	"prolateCycloid": {
		"description": "no description available",
		"equation":	""
	},
	"foliumOfDescartes": {
		"description": "This folium was first discussed by Descartes in 1638 but, although he found the correct shape of the curve in the positive quadrant, he believed that this leaf shape was repeated in each quadrant like the four petals of a flower.<br><br>The problem to determine the tangent to the curve was proposed to Roberval who also wrongly believed the curve had the form of a jasmine flower. His name of fleur de jasmin was later changed.<br><br>The curve is sometimes known as the noeud de ruban. The folium has an asymptote x + y + a = 0.<br><br>The equation of the tangent at the point with t = p is<p class='math'>p(p3 - 2)x + (1 - 2p3)y + 3ap2 = 0</p>The curve passes through the origin at t = 0 and approaches the origin a second time as t goes to infinity.",
		"equation":	""
	},
	"hypocycloid": {
		"description": "no description available",
		"equation":	""
	},
	"hypotrochoid": {
		"description": "no description available",
		"equation":	""
	},
	"epicycloid": {
		"description": "no description available",
		"equation":	""
	},
	"epitrochoid": {
		"description": "no description available"
		"equation":	""
	}
}

